#Создайте словарь person, в котором будут присутствовать ключи name, age, city. Выведите значение возраста из словаря person.
person = { 'name':'Tatyana', 'age':'27', 'sity':'Minsk' }
print(person['age'])




